Tekla Open API Reference for Tekla Structures 2025
LeaderLine.EndPoint Property
 The end point of the leader line (set by the parent object).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point EndPoint { get; }
Public ReadOnly Property EndPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
LeaderLine Class
Tekla.Structures.Drawing Namespace